In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("Passageiros.csv")

In [3]:
df.head(9)

   Categoria     Gênero  Idade      Valor      Embarque        Date
0          1  Masculino   22.0  R$ 300,00        Sábado  05-01-2019
1          2   Feminino   32.0  R$ 200,00  Quarta-Feira  02-01-2019
2          3  Masculino   23.0  R$ 160,00  Quarta-Feira  02-01-2019
3          1   Feminino   25.0  R$ 300,00       Domingo  06-01-2019
4          2  Masculino   23.0  R$ 200,00  Quarta-Feira  16-01-2019
5          3   Feminino   48.0  R$ 300,00        Sábado  12-01-2019
6          4   Feminino   53.0   R$ 80,00  Quinta-Feira  17-01-2019
7          1  Masculino   34.0  R$ 400,00        Sábado  12-01-2019
8          2   Feminino   67.0  R$ 200,00  Quinta-Feira  10-01-2019

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Categoria  9 non-null      int64
 1   Gênero     9 non-null      object
 2   Idade      9 non-null      float64
 3   Valor      9 non-null      object
 4   Embarque   9 non-null      object
 5   Date       9 non-null      object
dtypes: float64(1), int64(1), object(4)
memory usage: 560.0+ bytes

In [5]:
# Checar Tipo da coluna
df.Categoria.dtype

dtype('int64')

In [6]:
lista = [3,3,3,3,1,"a"]
serie_dic = pd.Series(lista)

In [7]:
# ?????
serie_dic.unique()

array([3, 1, 'a'], dtype=object)

In [8]:
# ?????
df.Valor.unique()

array(['R$ 300,00', 'R$ 200,00', 'R$ 160,00', 'R$ 80,00', 'R$ 400,00'],
      dtype=object)

In [9]:
df.Gênero

0    Masculino
1     Feminino
2    Masculino
3     Feminino
4    Masculino
5     Feminino
6     Feminino
7    Masculino
8     Feminino
Name: Gênero, dtype: object

In [10]:
# Vamos tornar isso em valores binários:
df.Gênero.replace(to_replace= ["Masculino", "Feminino"], value=[0, 1], inplace=True)

In [11]:
df.Gênero

0    0
1    1
2    0
3    1
4    0
5    1
6    1
7    0
8    1
Name: Gênero, dtype: int64

In [12]:
# Renomear Nome da Coluna:
df.rename(columns={'Gênero':'Genero'}, inplace=True)

In [13]:
# Agora Sem acento
df.head()

   Categoria  Genero  Idade      Valor      Embarque        Date
0          1       0   22.0  R$ 300,00        Sábado  05-01-2019
1          2       1   32.0  R$ 200,00  Quarta-Feira  02-01-2019
2          3       0   23.0  R$ 160,00  Quarta-Feira  02-01-2019
3          1       1   25.0  R$ 300,00       Domingo  06-01-2019
4          2       0   23.0  R$ 200,00  Quarta-Feira  16-01-2019

In [14]:
# Idade -> Modificar de Float para INT
df.Idade = df.Idade.astype(int)

In [15]:
# Agora Idade 'int64
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Categoria  9 non-null      int64
 1   Genero     9 non-null      int64
 2   Idade      9 non-null      int64
 3   Valor      9 non-null      object
 4   Embarque   9 non-null      object
 5   Date       9 non-null      object
dtypes: int64(3), object(3)
memory usage: 560.0+ bytes

In [27]:
# Lambda P/ Substituir R$ por Vazio
df['Valor'] = df['Valor'].apply(lambda x:x.replace("R$", ""))

In [28]:
df.Valor

0     300,00
1     200,00
2     160,00
3     300,00
4     200,00
5     300,00
6      80,00
7     400,00
8     200,00
Name: Valor, dtype: object

In [34]:
# Tipo Object 
df["Valor"].dtype

dtype('O')

In [29]:
# Virgula Por Ponto
df['Valor'] = df['Valor'].apply(lambda x:x.replace(",", "."))

In [30]:
df.Valor

0     300.00
1     200.00
2     160.00
3     300.00
4     200.00
5     300.00
6      80.00
7     400.00
8     200.00
Name: Valor, dtype: object

In [36]:
# Tendo agora Ponto ao inves de Virgula, Vamos tornar esta coluna em FLOAT
df.Valor = df.Valor.astype(float)

In [37]:
df.Valor

0    300.0
1    200.0
2    160.0
3    300.0
4    200.0
5    300.0
6     80.0
7    400.0
8    200.0
Name: Valor, dtype: float64

In [38]:
# cONVERTEMOS
df["Valor"].dtype

dtype('float64')

In [39]:
df.rename(columns={'Embarque':'Dia_Embarque'}, inplace=True)

In [40]:
df.Dia_Embarque

0          Sábado
1    Quarta-Feira
2    Quarta-Feira
3         Domingo
4    Quarta-Feira
5          Sábado
6    Quinta-Feira
7          Sábado
8    Quinta-Feira
Name: Dia_Embarque, dtype: object

In [43]:
# Pandas tornar Coluna Data em formato Date_Time
df.Date = pd.to_datetime(df.Date, format="%d-%m-%Y")

In [49]:
df.rename(columns={'Date':'Data'}, inplace=True)

In [48]:
# Formato DateTime para coluna Data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Categoria     9 non-null      int64
 1   Genero        9 non-null      int64
 2   Idade         9 non-null      int64
 3   Valor         9 non-null      float64
 4   Dia_Embarque  9 non-null      object
 5   Date          9 non-null      datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(3), object(1)
memory usage: 560.0+ bytes

In [50]:
df.Data

0   2019-01-05
1   2019-01-02
2   2019-01-02
3   2019-01-06
4   2019-01-16
5   2019-01-12
6   2019-01-17
7   2019-01-12
8   2019-01-10
Name: Data, dtype: datetime64[ns]